Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F08KL401.h
extern volatile T2CONBITS T2CONbits __attribute__((__sfr__));

#define TMR3 TMR3
extern volatile unsigned int  TMR3 __attribute__((__sfr__));
#define T3GCON T3GCON
extern volatile unsigned int  T3GCON __attribute__((__sfr__));
__extension__ typedef struct tagT3GCONBITS {
  union {
    struct {
      unsigned T3GSS:2;
      unsigned T3GVAL:1;
      unsigned T3GGO:1;
      unsigned T3GSPM:1;
      unsigned T3GTM:1;
      unsigned T3GPOL:1;
      unsigned TMR3GE:1;
    };
    struct {
      unsigned T3GSS0:1;
      unsigned T3GSS1:1;
      unsigned :1;
      unsigned NOT_T3DONE:1;
    };
    struct {
      unsigned TGSS:2;
      unsigned TGVAL:1;
      unsigned TGGO:1;
      unsigned TGSE:1;
      unsigned TGTM:1;
      unsigned TGPOL:1;
      unsigned TGATE:1;
    };
  };
} T3GCONBITS;
extern volatile T3GCONBITS T3GCONbits __attribute__((__sfr__));

#define T3CON T3CON
extern volatile unsigned int  T3CON __attribute__((__sfr__));
__extension__ typedef struct tagT3CONBITS {
  union {
    struct {
      unsigned TMR3ON:1;
      unsigned :1;
      unsigned NOT_T3SYNC:1;
      unsigned T3OSCEN:1;
      unsigned T3CKPS:2;
      unsigned TMR3CS:2;
    };
    struct {
      unsigned TON:1;
      unsigned :1;
      unsigned NOT_TSYNC:1;
      unsigned SOSCEN:1;
      unsigned TCKPS:2;
      unsigned TCS:2;
    };
    struct {
      unsigned :4;
      unsigned T3CKPS0:1;
      unsigned T3CKPS1:1;
      unsigned TMR3CS0:1;
      unsigned TMR3CS1:1;
    };
  };
} T3CONBITS;
extern volatile T3CONBITS T3CONbits __attribute__((__sfr__));

#define TMR4 TMR4
extern volatile unsigned int  TMR4 __attribute__((__sfr__));
#define PR4 PR4
extern volatile unsigned int  PR4 __attribute__((__sfr__));
#define T4CON T4CON
extern volatile unsigned int  T4CON __attribute__((__sfr__));
__extension__ typedef struct tagT4CONBITS {
  union {
    struct {
      unsigned T4CKPS:2;
      unsigned TMR4ON:1;
      unsigned T4OUTPS:4;
    };
    struct {
      unsigned TCKPS:2;
      unsigned TON:1;
      unsigned TOUTPS:4;
    };
    struct {
      unsigned T4CKPS0:1;
      unsigned T4CKPS1:1;
      unsigned :1;
      unsigned T4OUTPS0:1;
      unsigned T4OUTPS1:1;
      unsigned T4OUTPS2:1;
      unsigned T4OUTPS3:1;
    };
  };
} T4CONBITS;
extern volatile T4CONBITS T4CONbits __attribute__((__sfr__));

#define CCPTMRS0 CCPTMRS0
extern volatile unsigned int  CCPTMRS0 __attribute__((__sfr__));
typedef struct tagCCPTMRS0BITS {
  unsigned C1TSEL0:1;
  unsigned :2;
  unsigned C2TSEL0:1;
  unsigned :2;
  unsigned C3TSEL0:1;
} CCPTMRS0BITS;
extern volatile CCPTMRS0BITS CCPTMRS0bits __attribute__((__sfr__));

#define CCP1CON CCP1CON
extern volatile unsigned int  CCP1CON __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CONBITS {
  union {
    struct {
      unsigned CCPM:4;
      unsigned DCB:2;
      unsigned PM:2;
    };
    struct {
      unsigned CCPM0:1;
      unsigned CCPM1:1;
      unsigned CCPM2:1;
      unsigned CCPM3:1;
      unsigned DCB0:1;
      unsigned DCB1:1;
      unsigned PM0:1;
      unsigned PM1:1;
    };
    struct {
      unsigned CCP1M:4;
      unsigned DC1B:2;
      unsigned P1M:2;
    };
    struct {
      unsigned CCP1M0:1;
      unsigned CCP1M1:1;
      unsigned CCP1M2:1;
      unsigned CCP1M3:1;
      unsigned DC1B0:1;
      unsigned DC1B1:1;
      unsigned P1M0:1;
      unsigned P1M1:1;
    };
  };
} CCP1CONBITS;
extern volatile CCP1CONBITS CCP1CONbits __attribute__((__sfr__));

#define ECCP1CON ECCP1CON
extern volatile unsigned int  ECCP1CON __attribute__((__sfr__));
__extension__ typedef struct tagECCP1CONBITS {
  union {
    struct {
      unsigned CCPM:4;
      unsigned DCB:2;
      unsigned PM:2;
    };
    struct {
      unsigned CCPM0:1;
      unsigned CCPM1:1;
      unsigned CCPM2:1;
      unsigned CCPM3:1;
      unsigned DCB0:1;
      unsigned DCB1:1;
      unsigned PM0:1;
      unsigned PM1:1;
    };
    struct {
      unsigned CCP1M:4;
      unsigned DC1B:2;
      unsigned P1M:2;
    };
    struct {
      unsigned CCP1M0:1;
      unsigned CCP1M1:1;
      unsigned CCP1M2:1;
      unsigned CCP1M3:1;
      unsigned DC1B0:1;
      unsigned DC1B1:1;
      unsigned P1M0:1;
      unsigned P1M1:1;
    };
  };
} ECCP1CONBITS;
extern volatile ECCP1CONBITS ECCP1CONbits __attribute__((__sfr__));

#define CCPR1L CCPR1L
extern volatile unsigned char CCPR1L __attribute__((__sfr__));
#define CCPR1H CCPR1H
extern volatile unsigned char CCPR1H __attribute__((__sfr__));
#define ECCP1DEL ECCP1DEL
extern volatile unsigned int  ECCP1DEL __attribute__((__sfr__));
__extension__ typedef struct tagECCP1DELBITS {
  union {
    struct {
      unsigned PDC:7;
      unsigned PRSEN:1;
    };
    struct {
      unsigned PDC0:1;
      unsigned PDC1:1;
      unsigned PDC2:1;
      unsigned PDC3:1;
      unsigned PDC4:1;
      unsigned PDC5:1;
      unsigned PDC6:1;
    };
    struct {
      unsigned P1DC:7;
      unsigned P1RSEN:1;
    };
    struct {
      unsigned P1DC0:1;
      unsigned P1DC1:1;
      unsigned P1DC2:1;
      unsigned P1DC3:1;
      unsigned P1DC4:1;
      unsigned P1DC5:1;
      unsigned P1DC6:1;
    };
  };
} ECCP1DELBITS;
extern volatile ECCP1DELBITS ECCP1DELbits __attribute__((__sfr__));

#define PWM1CON PWM1CON
extern volatile unsigned int  PWM1CON __attribute__((__sfr__));
__extension__ typedef struct tagPWM1CONBITS {
  union {
    struct {
      unsigned PDC:7;
      unsigned PRSEN:1;
    };
    struct {
      unsigned PDC0:1;
      unsigned PDC1:1;
      unsigned PDC2:1;
      unsigned PDC3:1;
      unsigned PDC4:1;
      unsigned PDC5:1;
      unsigned PDC6:1;
    };
    struct {
      unsigned P1DC:7;
      unsigned P1RSEN:1;
    };
    struct {
      unsigned P1DC0:1;
      unsigned P1DC1:1;
      unsigned P1DC2:1;
      unsigned P1DC3:1;
      unsigned P1DC4:1;
      unsigned P1DC5:1;
      unsigned P1DC6:1;
    };
  };
} PWM1CONBITS;
extern volatile PWM1CONBITS PWM1CONbits __attribute__((__sfr__));

#define ECCP1AS ECCP1AS
extern volatile unsigned int  ECCP1AS __attribute__((__sfr__));
__extension__ typedef struct tagECCP1ASBITS {
  union {
    struct {
      unsigned PSSBD:2;
      unsigned PSSAC:2;
      unsigned ECCPAS:3;
      unsigned ECCPASE:1;
    };
    struct {
      unsigned PSSBD0:1;
      unsigned PSSBD1:1;
      unsigned PSSAC0:1;
      unsigned PSSAC1:1;
      unsigned ECCPAS0:1;
      unsigned ECCPAS1:1;
      unsigned ECCPAS2:1;
    };
    struct {
      unsigned PSS1BD:2;
      unsigned PSS1AC:2;
      unsigned ECCP1AS:3;
    };
    struct {
      unsigned PSS1BD0:1;
      unsigned PSS1BD1:1;
      unsigned PSS1AC0:1;
      unsigned PSS1AC1:1;
      unsigned ECCP1AS0:1;
      unsigned ECCP1AS1:1;
      unsigned ECCP1AS2:1;
    };
  };
} ECCP1ASBITS;
