Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F08KL401.h
#define _PMDIS1_T4MD_POSITION                    0x0000000E
#define _PMDIS1_T4MD_MASK                        0x00004000
#define _PMDIS1_T4MD_LENGTH                      0x00000001

#define _PMDIS1_ADCMD_POSITION                   0x00000000
#define _PMDIS1_ADCMD_MASK                       0x00000001
#define _PMDIS1_ADCMD_LENGTH                     0x00000001

#define _PMDIS1_I2C1MD_POSITION                  0x00000007
#define _PMDIS1_I2C1MD_MASK                      0x00000080
#define _PMDIS1_I2C1MD_LENGTH                    0x00000001

#define _PMDIS1_SPI1MD_POSITION                  0x00000007
#define _PMDIS1_SPI1MD_MASK                      0x00000080
#define _PMDIS1_SPI1MD_LENGTH                    0x00000001

#define _PMD2_CCP1MD_POSITION                    0x00000000
#define _PMD2_CCP1MD_MASK                        0x00000001
#define _PMD2_CCP1MD_LENGTH                      0x00000001

#define _PMD2_CCP2MD_POSITION                    0x00000001
#define _PMD2_CCP2MD_MASK                        0x00000002
#define _PMD2_CCP2MD_LENGTH                      0x00000001

#define _PMD2_CCP3MD_POSITION                    0x00000002
#define _PMD2_CCP3MD_MASK                        0x00000004
#define _PMD2_CCP3MD_LENGTH                      0x00000001

#define _PMDIS2_CCP1MD_POSITION                  0x00000000
#define _PMDIS2_CCP1MD_MASK                      0x00000001
#define _PMDIS2_CCP1MD_LENGTH                    0x00000001

#define _PMDIS2_CCP2MD_POSITION                  0x00000001
#define _PMDIS2_CCP2MD_MASK                      0x00000002
#define _PMDIS2_CCP2MD_LENGTH                    0x00000001

#define _PMDIS2_CCP3MD_POSITION                  0x00000002
#define _PMDIS2_CCP3MD_MASK                      0x00000004
#define _PMDIS2_CCP3MD_LENGTH                    0x00000001

#define _PMD3_SSP2MD_POSITION                    0x00000001
#define _PMD3_SSP2MD_MASK                        0x00000002
#define _PMD3_SSP2MD_LENGTH                      0x00000001

#define _PMD3_CMPMD_POSITION                     0x0000000A
#define _PMD3_CMPMD_MASK                         0x00000400
#define _PMD3_CMPMD_LENGTH                       0x00000001

#define _PMD3_I2C2MD_POSITION                    0x00000001
#define _PMD3_I2C2MD_MASK                        0x00000002
#define _PMD3_I2C2MD_LENGTH                      0x00000001

#define _PMD3_SPI2MD_POSITION                    0x00000001
#define _PMD3_SPI2MD_MASK                        0x00000002
#define _PMD3_SPI2MD_LENGTH                      0x00000001

#define _PMDIS3_SSP2MD_POSITION                  0x00000001
#define _PMDIS3_SSP2MD_MASK                      0x00000002
#define _PMDIS3_SSP2MD_LENGTH                    0x00000001

#define _PMDIS3_CMPMD_POSITION                   0x0000000A
#define _PMDIS3_CMPMD_MASK                       0x00000400
#define _PMDIS3_CMPMD_LENGTH                     0x00000001

#define _PMDIS3_I2C2MD_POSITION                  0x00000001
#define _PMDIS3_I2C2MD_MASK                      0x00000002
#define _PMDIS3_I2C2MD_LENGTH                    0x00000001

#define _PMDIS3_SPI2MD_POSITION                  0x00000001
#define _PMDIS3_SPI2MD_MASK                      0x00000002
#define _PMDIS3_SPI2MD_LENGTH                    0x00000001

#define _PMD4_HLVDMD_POSITION                    0x00000001
#define _PMD4_HLVDMD_MASK                        0x00000002
#define _PMD4_HLVDMD_LENGTH                      0x00000001

#define _PMD4_REFOMD_POSITION                    0x00000003
#define _PMD4_REFOMD_MASK                        0x00000008
#define _PMD4_REFOMD_LENGTH                      0x00000001

#define _PMD4_EEMD_POSITION                      0x00000004
#define _PMD4_EEMD_MASK                          0x00000010
#define _PMD4_EEMD_LENGTH                        0x00000001

#define _PMD4_ULPWUMD_POSITION                   0x00000007
#define _PMD4_ULPWUMD_MASK                       0x00000080
#define _PMD4_ULPWUMD_LENGTH                     0x00000001

#define _PMDIS4_HLVDMD_POSITION                  0x00000001
#define _PMDIS4_HLVDMD_MASK                      0x00000002
#define _PMDIS4_HLVDMD_LENGTH                    0x00000001

#define _PMDIS4_REFOMD_POSITION                  0x00000003
#define _PMDIS4_REFOMD_MASK                      0x00000008
#define _PMDIS4_REFOMD_LENGTH                    0x00000001

#define _PMDIS4_EEMD_POSITION                    0x00000004
#define _PMDIS4_EEMD_MASK                        0x00000010
#define _PMDIS4_EEMD_LENGTH                      0x00000001

#define _PMDIS4_ULPWUMD_POSITION                 0x00000007
#define _PMDIS4_ULPWUMD_MASK                     0x00000080
#define _PMDIS4_ULPWUMD_LENGTH                   0x00000001



/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Register FBS (0xf80000)                               */

extern __attribute__((space(prog))) unsigned int _FBS;
#define _FBS(x) __attribute__((section("__FBS.sec"),space(prog))) unsigned int _FBS = (x);

/*
** Only one invocation of FBS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBS.
** Multiple options may be combined, as shown:
**
** _FBS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write Protect:
**     BWRP_ON              Enabled
**     BWRP_OFF             Disabled
**
**   Boot segment Protect:
**     BSS_HI1K             High Security Boot Protect 000200 - 000AFE
**     BSS_STD1K            Standard Security Boot Protect 000200 - 000AFE
**     BSS_OFF              No boot flash segment
**
*/

#define BWRP_ON              0xFFFE
#define BWRP_OFF             0xFFFF

#define BSS_HI1K             0xFFF5
#define BSS_STD1K            0xFFFD
#define BSS_OFF              0xFFFF

/* Register FGS (0xf80004)                               */

extern __attribute__((space(prog))) unsigned int _FGS;
#define _FGS(x) __attribute__((section("__FGS.sec"),space(prog))) unsigned int _FGS = (x);

